Revit 2024 API
Sweep.PathSketch Property
The sketched path for the sweep.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Sketch PathSketch { get; }
Visual Basic
Public ReadOnly Property PathSketch As Sketch
	Get
Visual C++
public:
property Sketch^ PathSketch {
	Sketch^ get ();
}
Remarks
If the sweep is based on selected 3d curves, this property is null.
See Also
Sweep Class
Autodesk.Revit.DB Namespace